<a href="https://colab.research.google.com/github/cherrrity/SOLUX_summer_data/blob/master/1%EC%A3%BC%EC%B0%A8/%ED%8C%90%EB%8D%94%EC%8A%A4_%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B6%84%EC%84%9D_%EA%B8%B0%EC%B4%88_0_~_6_(2020_07_23).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# 첫 번째 강의 
# 팬더스, 데이터프레임, 시리즈 알아보기

import pandas as pd

s1 = pd.core.series.Series([1,2,3])
s2 = pd.core.series.Series(['one','two','three'])
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [ ]:
# 두 번째 강의
# 파일에서 데이터 불러오기

# csv 파일이 없어서 sample_data 사용합니다..

data1 = pd.read_csv('/content/sample_data/mnist_test.csv')

data1.head()

   7  0  0.1  0.2  0.3  0.4  ...  0.662  0.663  0.664  0.665  0.666  0.667
0  2  0    0    0    0    0  ...      0      0      0      0      0      0
1  1  0    0    0    0    0  ...      0      0      0      0      0      0
2  0  0    0    0    0    0  ...      0      0      0      0      0      0
3  4  0    0    0    0    0  ...      0      0      0      0      0      0
4  1  0    0    0    0    0  ...      0      0      0      0      0      0

[5 rows x 785 columns]

In [ ]:
data1.head(2)

   7  0  0.1  0.2  0.3  0.4  ...  0.662  0.663  0.664  0.665  0.666  0.667
0  2  0    0    0    0    0  ...      0      0      0      0      0      0
1  1  0    0    0    0    0  ...      0      0      0      0      0      0

[2 rows x 785 columns]

In [ ]:
data2 = pd.read_csv('/content/sample_data/friend_list.txt', delimiter = "\t", header= None, names=['이름','나이','직업'])

data2

      이름   나이         직업
0   name  age        job
1   John   20    student
2  Jenny   30  developer
3   Nate   30    teacher
4  Julia   40    dentist
5  Brian   30    manager
6  Chris   24     intern

In [ ]:
# 세 번째 강의
# 데이터 프레임 생성하기


friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job' : 'student'},
    {'name' : 'John', 'age' : 25, 'job' : 'student'}
]

df = pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   25  student
1  John   25  student

In [ ]:
#OrderedDict
from collections import OrderedDict

In [ ]:
friend_ordered_dict = OrderedDict(
    [
     ('name', ['John','Nate']),
     ('age', [25, 30]),
     ('job', ['student','teacher'])
    ]
)

df2 = pd.DataFrame.from_dict(friend_ordered_dict)
df2.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
friend_list = [
               ['John', 20, 'student'],
               ['Nate', 30, 'teacher']
]

column_name = ['name', 'age', 'job']

df3 = pd.DataFrame.from_records(friend_list, columns = column_name)

df3.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [ ]:
friend_list2 = [
                ['name',['John', 'Nate']],
                ['age',[25, 30]],
                ['job',['student','teacher']]
]


#DataFrame에 from_items가 없다는데 무슨 이유일까요..?
#df4 = pd.DataFrame.from_items()

df4 = pd.DataFrame.from_dict(OrderedDict(friend_list2))

df4.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
# 네 번째 강의
# 데이터 프레임 저장하기

df.head()


# 그냥 저장
df.to_csv('friends.csv')

# 옵션 저장
df.to_csv('friends2.csv', index= False, header= False, na_rep= "-" )

In [ ]:
df1 = pd.read_csv('/content/friends.csv')
df1

   Unnamed: 0  name  age      job
0           0  John   25  student
1           1  John   25  student

In [ ]:
df2 = pd.read_csv('/content/friends2.csv')
df2

   John  25  student
0  John  25  student

In [ ]:
# 다섯 번째 강의
# 데이터 프레임 행, 열 선택 및 필터 하기


df2 = df[1:3]

df2

   name  age      job
1  John   25  student

In [ ]:
df2 = df2.loc[[0,1]]

df2

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [ ]:
df.query('age>24')

   name  age      job
0  John   25  student
1  John   25  student

In [ ]:
df[(df.age >= 25) & (df.name == 'John')]

   name  age      job
0  John   25  student
1  John   25  student

In [ ]:
friend_list = [
               ['John', 20, 'student'],
               ['Janny', 25, 'developer'],
               ['Nate', 30, 'teacher'],
]

df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Janny  25  developer
2   Nate  30    teacher

In [ ]:
df.iloc[:,0:2]

       0   1
0   John  20
1  Janny  25
2   Nate  30

In [ ]:
df.iloc[0:2, 0:2]

       0   1
0   John  20
1  Janny  25

In [ ]:
df4[['name','age']]

   name  age
0  John   25
1  Nate   30

In [ ]:
df4.filter(like='a', axis=1)

   name  age
0  John   25
1  Nate   30

In [ ]:
df4.filter(regex = 'b$', axis=1)

       job
0  student
1  teacher

In [ ]:
df4.filter(regex = 'e$', axis=1)

   name  age
0  John   25
1  Nate   30

In [ ]:
# 여섯 번째 강의
# 데이터 프레임 행, 열 삭제하기

friends = [
           {'age': 15, 'job' : 'studnet'}, 
           {'age': 24, 'job' : 'developer'}, 
           {'age': 32, 'job' : 'teacher'}, 
           ]
df = pd.DataFrame(friends, 
                  index =['John', 'Jenny', 'Nate'],
                  columns = ['age', 'job'])

df

       age        job
John    15    studnet
Jenny   24  developer
Nate    32    teacher

In [ ]:
df.drop(['John','Nate'])

       age        job
Jenny   24  developer

In [ ]:
df

       age        job
John    15    studnet
Jenny   24  developer
Nate    32    teacher

In [ ]:
df = df.drop(['John','Nate'])
df

       age        job
Jenny   24  developer

In [ ]:
df

       age        job
John    15    studnet
Jenny   24  developer
Nate    32    teacher

In [ ]:
friends = [
           {'name' : 'John', 'age' : 15 , 'job' : 'student'},
           {'name' : 'Ben', 'age' : 34 , 'job' : 'developer'},
           {'name' : 'Jerry', 'age' : 29 , 'job' : 'teacher'},
           {'name' : 'Kate', 'age' : 23 , 'job' : 'singer'},
           ]

df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])

df

    name  age        job
0   John   15    student
1    Ben   34  developer
2  Jerry   29    teacher
3   Kate   23     singer

In [ ]:
df = df.drop(df.index[[0,2]])
df

   name  age        job
1   Ben   34  developer
3  Kate   23     singer

In [ ]:
df = df[df.age > 25]

In [ ]:
df

  name  age        job
1  Ben   34  developer

In [ ]:
# 컬럼 없애기

df = df.drop('age', axis=1)
df

    name        job
0   John    student
1    Ben  developer
2  Jerry    teacher
3   Kate     singer

In [ ]:
df.drop('name', axis=1, inplace = True)

In [ ]:
df

         job
0    student
1  developer
2    teacher
3     singer